Measure_samples.org
***** TODO Basic parameters layout
#+BEGIN_SRC python
  def ui_basic_param_layout(window):
      basic_params = window.ui_config.config._b_params ## Fix this
      # Num parameters fields
      jv_label, jv_text = num_param_label_textbox(basic_params.juncture)
      ps_label, ps_text = num_param_label_textbox(basic_params.piezo_speed)
      tr_label, tr_text = num_param_label_textbox(basic_params.traces)
      # Change directory dialog and fields
      dir_label = QtGui.QLabel(basic_params.data_dir.path)
      dir_btn = QtGui.QPushButton('Change Directory')
      dir_btn.clicked.connect(lambda: showDialog(window,dir_label))
      # Add fields to the layout
      grid = QtGui.QGridLayout()
      grid.setSpacing(10)

      grid.addWidget(jv_label,1,0)
      grid.addWidget(jv_text,1,1)

      grid.addWidget(ps_label,2,0)
      grid.addWidget(ps_text,2,1)

      grid.addWidget(tr_label,3,0)
      grid.addWidget(tr_text,3,1)

      grid.addWidget(dir_label,4,0)
      grid.addWidget(dir_btn,4,1)

      return grid
#+END_SRC

***** TODO Advanced parameters layout

***** TODO Presentation parameters layout
#+BEGIN_SRC python

  def ui_adv_param_layout(window):
      return ui_basic_param_layout(window)

  def ui_presentation_param_layout(window):
      return ui_basic_param_layout(window)

#+END_SRC

***** TODO Configuration parameters layout utilities
As previously stated, some of the functionalities that are required to describe a configuration parameter layout are too complex to be described clearly within each parameter layout, and these are common, so in order to keep the code and the structure as simple as possible, these functionalities are described separately. The utilities are:
- Parameter validator :: Most parameters are numerical, and the functionality described in [[Numerical parameter validator]], ensures that the user does not enter invalid values
- Parameter label creator :: Parameters that are entered through a text-box, have the same functionality, which only depends on the parameter at hand. The functionality described in  [[Parameter labels]] creates the labels based only on the parameter
- Change directory dialog :: A simple functionality to show the change directory dialog to the user is described in [[Change directory dialog]]

****** DONE Numerical parameter validator
The GUI is described using PyQt, which provides a mechanism to ensure that no invalid values are written or stored in the different txet-boxes. This mechanism is provided through the definition of a specialization of the [[http://doc.qt.io/qt-4.8/qvalidator.html][QValidator Class]], as shown in [[src-qvalidator-num-param]].

The overloading is performed by adding a parameter to the validator in the initialization function shown in line [[(src-qvalidator-np-init)]]. Then the =validate= function is overloaded by leveraging the =validate= function of the parameter as shown in the line [[(src-qvalidator-np-val)]], and allowing only values that are valid for the parameter.

#+CAPTION: QValidator specialization for numerical parameters
#+NAME: src-qvalidator-num-param
#+BEGIN_SRC python -n -r
  #############################################################
  ## @class   QValidator_num_param
  #  @brief   Validator for numerical parameters
  #
  #  @details This class provides a specialization of the
  #           QValidator class for numerical parameters and
  #           allow only values that are valid for the
  #           parameter.
  #############################################################
  class QValidator_num_param(QtGui.QValidator):
          #############################################################
          ## @brief   Initialization function, with the parameter
          #############################################################
          def __init__(self, param): #(ref:src-qvalidator-np-init)
              QtGui.QValidator.__init__(self)
              self.param = param
          #############################################################
          ## @brief   Validate function using the parameter validation
          #           Ensures data is a number.
          #############################################################
          def validate(self, text, pos):#(ref:src-qvalidator-np-val)
                  try:
                          num = float(text)
                  except ValueError:
                          return (QtGui.QValidator.Invalid, pos)

                  if self.param.validate(num):
                          self.param.update(num)
                          return (QtGui.QValidator.Acceptable, pos)
                  return (QtGui.QValidator.Invalid, pos)
#+END_SRC

****** TODO Parameter labels
To provide the GUI for a parameter, a label and a text-box are needed, however for numerical parameters, the only difference between a set is the parameter, therefore a function is created that create both based only on a specific parameter.

#+BEGIN_SRC python
  #############################################################
  ## @brief   Creates a label and textbox for a numerical
  #           parameter.
  #############################################################
  def num_param_label_textbox(parameter):
      label = QtGui.QLabel(parameter.name)
      textbox = QtGui.QLineEdit()
      param_validator = QValidator_num_param(parameter)
      textbox.setValidator(param_validator)
      textbox.setText(str(parameter.value))
      return (label, textbox)
#+END_SRC

****** Change directory dialog
#+BEGIN_SRC python
  def showDialog(window,dir_label):
      data_dir = window.ui_config.config._b_params.data_dir
      fname = QtGui.QFileDialog.getExistingDirectory(window, 'Open file',
              data_dir.path)
      if(fname):
          data_dir.update(fname)
          dir_label.setText(data_dir.path)
          print(data_dir.path)
#+END_SRC

** TODO Motor break junction 
   :PROPERTIES:
   :tangle:   modules/motor_break.py
   :END:
#+BEGIN_SRC python
  def motor_break_juncture():
      print ("Picked Motor break")

#+END_SRC

** TODO Measurement with Piezo
   :PROPERTIES:
   :tangle:   modules/piezo_measure.py
   :END:
   
#+BEGIN_SRC python
  def measure_sample():
      print("Picked measure sample")

#+END_SRC

** TODO General purpose Utilities
   :PROPERTIES:
   :tangle:   modules/utilities.py
   :noweb:    tangle
   :comments: link
   :END:
As with many programs, there are some general purpose functionalities that do not fit cleanly in other sections or files. This section is for these types of utilities.
#+BEGIN_SRC python :exports none
  #################################################################
  ## @file    utilities.py
  #  @author  Joaquin Figueroa
  #  @brief   General purpose utilities
  #
  #  @details This file stores several general purpose utilities
  #           that do not fit cleanly anywhere else. Obviously
  #           grat care has been tanke to ensure that this file
  #           is kept small
  #################################################################
  import os
  import inspect
#+END_SRC
*** Path utilities.
Although Python already provides with a good interface to interface with the filesystem, without going into the specifics, there is still a need to provide some specific functionality for the program considering the usage of several files in the filesystem relative to the script root, thus to provide with the appropriate interface, this archive provides:
- Determine script root :: This program uses several files in paths relative to the script root, therefore is necessary to provide a functionality to determine the script root.
#+BEGIN_SRC python
  #############################################################
  ## @brief   Returns the path to the main.py directory
  #  @details Uses the inspect functionality to determine
  #           the current filename, then determines the
  #           absolute path. Since this file is at a fixed
  #           path from the script_root, it's returned
  #############################################################
  def get_script_root_path():
      fname = inspect.getframeinfo(inspect.currentframe()).filename
      module_path = os.path.dirname(os.path.abspath(fname))
      script_root_path = os.path.dirname(module_path)
      return script_root_path
#+END_SRC 
* ADwin Driver
The Adwin instrument is capable of controlling the piezo actuator and to take measurements by using its several hardware interfaces. Thus is the ADwin which actually performs the measurements by using different *process* or sub-routines, written in basic, and then handing the data back to the main program. These sub-routines must be compiled and then loaded into the instrument, so any program that process the data, is reduced to query the results of the measurements.

For the measurements required in the break-junction experiment the following process have been identified:
- Juncture Voltage Measurement :: This process is used to measure the voltage  and current on the juncture, periodically for a given time
      see [[file:basic_orig/Gt_MUX12.bas]]
- Juncture Voltage Histogram :: This process uses some of the same sub-routines to measure the voltage and current on the juncture, but perform the same measurement several times as it also actuates on the piezoelectric actuator to perform the breaking and joining of the juncture.
      see [[file:basic_orig/piezo_histogram.bas]]

* Faulhaber Driver
  :PROPERTIES:
  :tangle:   modules/Faulhaber_driver.py
  :noweb:    tangle
  :comments: link
  :END:
The Faulhaber motor is used to perform the initial breaking of the juncture as it has a far larger dynamic range than possible with a single piezoelectric actuator. The driver class defines an interface for the rest of the program 

As with many files, this file has a description header and the corresponding includes. In order to control the motor, the generic [[http://pyvisa.readthedocs.io/en/stable/index.html][Python Visa]] interface is used.
#+BEGIN_SRC python
  #################################################################
  ## @file    Faulhaber_driver.py
  #  @author  Joaquin Figueroa
  #  @date    Sun Sep 18, 2016
  #  @brief   Provides the interfaces for the Faulhaber motor
  #
  #  @details This file provides only the faulhaber interface,
  #           which defines high and low level functionalities.
  #           The user should use the high level functionality
  #           if possible.
  #           Also this file provides with some extra utilities
  #           that are not necesary inside the same faulhaber
  #           class.
  #################################################################
  import visa
#+END_SRC

The rest of the file is organized in 3 mayor sections:
- Constants :: The motor has some constant that are related to physical parameters of it, or the ports used for communication. These are defined in [[Faulhaber Constants]]
- Utilities :: There are some minor utilities that do not really belong inside the faulhaber class, these are defined in [[Faulhaber Utilities]]
- Faulhaber Driver :: The faulhaber driver is the python class that provides the full interface to the motor. Its defined in [[Faulhaber Driver Class]]

** Faulhaber Constants
As previously mentioned, the Faulhaber VISA interface, and some of the physical parameter of the motor are stored as global constants.
The constants are:
- Port :: Defined in line [[(fh-const-port)]], describes the port used to communicate with the motor.
- Baud rate :: Defined in line [[(fh-const-br)]]Is the communication rate in the channel used by the motor interface with the computer
- Motor Pitch :: Defined in line [[(fh-const-pitch)]], describes the pitch angle of the differential screw of the motor, relating a distance to an angle of the motor. 
- Motor gearbox :: Defined in line [[(fh-const-gear)]], describes the gearbox multiplier of the motor, indicating how many full revolutions of the motor correspond to a given target angle.
- Motor Maximum position :: Described in line [[(fh-const-max)]] Describes the maximum position allowed for the motor as to avoid damaging the equipment.
- Motor Minimum position ::  Described in line [[(fh-const-min)]] Describes the minimum position allowed for the motor to avoid damaging the equipment
- Motor Max Speed :: Described in line [[(fh-const-max-speed)]] Describes the maximum speed in *[rpm]* for the motor
- Motor Maximum acceleration  :: Described in line [[(fh-const-accel)]] Describes the maximum acceleration required for the motor  in *[rpm/s]*

#+CAPTION: Description of the basic constants used by the faulhaber motor driver
#+NAME: src-faulhaber-constants
#+BEGIN_SRC python -n -r
  #################################################################
  ## @author  Joaquin Figueroa
  #  @brief   Constants used for the faulhaber interface
  #
  #  @details These are the constants used by the faulhaber
  #           interface.
  #################################################################
  class fh_const:
      port = "COM3" #(ref:fh-const-port)
      baud_rate = 9600 #(ref:fh-const-br)
      pitch = 150 #(ref:fh-const-pitch)
      gearbox = 246 #(ref:fh-const-gear)
      max_pos =  5000000#(ref:fh-const-max)
      min_pos = -7000000#(ref:fh-const-min)
      max_speed = 800#in RPM(ref:fh-const-max-speed)
      max_accel = 40#in RPM/s(ref:fh-const-accel)
#+END_SRC
